testcases/two_membranes/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform -1.1536982351695373;

boundaryField
{
    top
    {
        type            fixedValue;
        value uniform -1.1536982351695373;
    }

    bottom
    {
        type            fixedValue;
        value uniform -1.1536982351695373;
    }

    left
    {
          type            empty;
    }

    right
    {
        type            empty;
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
